; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-3-3)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	)
(:init
	(at plane1 city2)
	(= (capacity plane1) 7614)
	(= (fuel plane1) 1985)
	(= (slow-burn plane1) 3)
	(= (fast-burn plane1) 7)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 5)
	(at plane2 city3)
	(= (capacity plane2) 12673)
	(= (fuel plane2) 2225)
	(= (slow-burn plane2) 5)
	(= (fast-burn plane2) 19)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 5)
	(at plane3 city2)
	(= (capacity plane3) 14710)
	(= (fuel plane3) 3248)
	(= (slow-burn plane3) 5)
	(= (fast-burn plane3) 12)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 6)
	(at person1 city2)
	(at person2 city0)
	(at person3 city3)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 999)
	(= (distance city0 city2) 522)
	(= (distance city0 city3) 935)
	(= (distance city1 city0) 999)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 581)
	(= (distance city1 city3) 795)
	(= (distance city2 city0) 522)
	(= (distance city2 city1) 581)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 655)
	(= (distance city3 city0) 935)
	(= (distance city3 city1) 795)
	(= (distance city3 city2) 655)
	(= (distance city3 city3) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city1)
	(at person2 city1)
	(at person3 city3)
	))

(:metric minimize (+ (* 1 (total-time))  (* 5 (total-fuel-used))))
)

; plan
1. (board person1 plane1 city2)
   deleted: (at person1 city2)
   added: (in person1 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 1 of 3
2. (fly plane1 city2 city1)
   deleted: (at plane1 city2)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 0 to 1743, (fuel plane1) from 1985 to 242
   goals met: 1 of 3
3. (debark person1 plane1 city1)
   deleted: (in person1 plane1)
   added: (at person1 city1)
   changed: (onboard plane1) from 1 to 0
   goals met: 2 of 3
4. (fly plane3 city2 city1)
   deleted: (at plane3 city2)
   added: (at plane3 city1)
   changed: (total-fuel-used) from 1743 to 4648, (fuel plane3) from 3248 to 343
   goals met: 2 of 3
5. (refuel plane3 city1)
   changed: (fuel plane3) from 343 to 14710
   goals met: 2 of 3
6. (fly plane3 city1 city0)
   deleted: (at plane3 city1)
   added: (at plane3 city0)
   changed: (total-fuel-used) from 4648 to 9643, (fuel plane3) from 14710 to 9715
   goals met: 2 of 3
7. (board person2 plane3 city0)
   deleted: (at person2 city0)
   added: (in person2 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 2 of 3
8. (fly plane3 city0 city1)
   deleted: (at plane3 city0)
   added: (at plane3 city1)
   changed: (total-fuel-used) from 9643 to 14638, (fuel plane3) from 9715 to 4720
   goals met: 2 of 3
9. (debark person2 plane3 city1)
   deleted: (in person2 plane3)
   added: (at person2 city1)
   changed: (onboard plane3) from 1 to 0
   goals met: 3 of 3
